Repository: OpenMandrivaAssociation/digikam
Catalog: kipiplugin_panorama_*.po
Languages: ru

source: Panorama Creator Wizard
ru: Мастер создания Panorama

source: <b>Welcome to Panorama Tool</b>
ru: <b>Добро пожаловать в Panorama!</b>

source: <qt><p><h1><b>Welcome to Panorama tool</b></h1></p><p>This tool stitches several images together to create a panorama, making the seam between images not visible.</p><p>This assistant will help you to configure how to import images before stitching them into a panorama.</p><p>Images must be taken from the same point of view.</p><p>For more information, please take a look at <a href='http://hugin.sourceforge.net/tutorials/overview/en.shtml'>this page</a></p></qt>
ru: <qt><p><h1><b>Добро пожаловать в Panorama!</b></h1></p><p>Этот инструмент бесшовно сшивает несколько изображений в единую панораму.</p><p>Мастер поможет вам настроить импорт изображений перед тем, как создавать панораму.</p><p>Снимки должны быть сделаны из одной точки и иметь одинаковый угол обзора.</p><p>Более подробную информацию см. на <a href='http://hugin.sourceforge.net/tutorials/overview/en.shtml'>этой странице</a>.</p></qt>

source: Panorama Binaries
ru: Исполняемые файлы Panorama

source: Panorama Settings
ru: Настройки панорамы

source: HDR output
ru: Вывод HDR

source: When checked, the panorama will be stitched into an High Dynamic Range (HDR) image, that can be processed further with a dedicated software.
ru: Если включить эту опцию, панорама будет сшита в одно HDR-изображение (изображение с широким динамическим диапазоном), которое затем можно будет обрабатывать в специальных программах.

source: <b>HDR output</b>: Output in High Dynamic Range, meaning that every piece of information contained in the original photos are preserved. Note that you need another software to process the resulting panorama, like <a href="http://qtpfsgui.sourceforge.net/">Luminance HDR</a>
ru: <b>Вывод HDR</b>: вывод с широким динамическим диапазоном, то есть с сохранением всей оригинальной информации изображений. Внимание: для обработки полученной таким образом панорамы понадобится другая программа, например <a href="http://qtpfsgui.sourceforge.net/">Luminance HDR</a>

source: File Format
ru: Формат файла

source: JPEG output
ru: Вывод в JPEG

source: Selects a JPEG output with 90% compression rate (lossy compression, smaller size).
ru: Вывод в формат JPEG с коэффициентом сжатия 90% (сжатие с потерями, маленький размер файла).

source: <b>JPEG output</b>: Using JPEG output, the panorama file will be smaller at the cost of information loss during compression. This is the easiest way to share the result, or print it online or in a shop.
ru: <b>Вывод в JPEG</b>: с использованием формата JPEG файл панорамы будет небольшим за счёт потери информации в результате сжатия. Это самый простой способ, если вы хотите поделиться результатом в Интернете или распечать через он-лайн сервис.

source: TIFF output
ru: Вывод в TIFF

source: Selects a TIFF output compressed using the LZW algorithm (lossless compression, bigger size).
ru: Вывод в формат TIFF, сжатый с помощью алгоритма LZW (сжатие без потерь, большой размер файла)

source: <b>TIFF output</b>: Using TIFF output, you get the same color depth than your original photos using RAW images at the cost of a bigger panorama file.
ru: <b>Вывод в TIFF</b>: формат TIFF сохраняет глубину цвета, аналогичную оригиналам в формате RAW, за счёт большого размера файла панорамы.

source: <b>Set Panorama Images</b>
ru: <b>Указать изображения для Panorama</b>

source: <qt><p>Set here the list of your images to blend into a panorama. Please follow these conditions:</p><ul><li>Images are taken from the same point of view.</li><li>Images are taken with the same camera (and lens).</li><li>Do not mix images with different color depth.</li></ul><p>Note that, in the case of a 360° panorama, the first image in the list will be the image that will be in the center of the panorama.</p></qt>
ru: <qt><p>Настройка списка изображений, которые нужно сшить в панораму. Изображения должны отвечать следующим условиям:</p><ul><li>изображения должны быть сняты из одной точки</li><li>изображения должны быть сняты одной и той же камерой (и объективом)</li><li>нельзя выбирать изображения с разной глубиной цвета</li></ul><p>Внимание: в панорамах на 360° первым изображением в списке стоит изображение, которое будет находиться в центре панорамы.</p></qt>

source: <b>Panorama Stitched</b>
ru: <b>Сшитая панорама</b>

source: Save Settings
ru: Сохранить настройки

source: File name template:
ru: Шаблон имени файла:

source: Name of the panorama file (without its extension).
ru: Имя файла панорамы (без расширения)

source: <b>File name template</b>: Set here the base name of the files that will be saved. For example, if your template is <i>panorama</i> and if you chose a JPEG output, then your panorama will be saved with the name <i>panorama.jpg</i>. If you choose to save also the project file, it will have the name <i>panorama.pto</i>.
ru: <b>Шаблон имени файла</b>: укажите здесь базовое имя сохраняемых файлов. Например, с шаблоном <i>panorama</i> и с выводом в формат JPEG, файл панорамы будет сохранён как <i>panorama.jpg</i>. Если выбрать также сохранение файла проекта, то у него будет имя <i>panorama.pto</i>.

source: Save project file
ru: Сохранить файл проекта

source: Save the project file for further processing within Hugin GUI.
ru: Сохранить файл проекта для дальнейшей обработки в Hugin.

source: <b>Save project file</b>: You can keep the project file generated to stitch your panorama for further tweaking within <a href="http://hugin.sourceforge.net/">Hugin</a> by checking this. This is useful if you want a different projection, modify the horizon or the center of the panorama, or modify the control points to get better results.
ru: <b>Сохранить файл проекта</b>: отметив эту опцию, можно сохранить файл созданного проекта для дальнейшего изменения в программе <a href="http://hugin.sourceforge.net/">Hugin</a>. Это удобно, если необходима другая проекция, если нужно изменить горизонт или центр панорамы, или же изменить контрольные точки для получения лучшего результата.

source: <qt><p><font color="red"><b>Error:</b> %1</font></p></qt>
ru: <qt><p><font color="red"><b>Ошибка:</b> %1</font></p></qt>

source: <qt><p><h1><b>Panorama Stitching is Done</b></h1></p><p>Congratulations. Your images are stitched into a panorama.</p><p>Your panorama will be created to the directory</p><p><b>%1</b></p><p>once you press the <i>Finish</i> button, with the name set below.</p><p>If you choose to save the project file, and if your images were raw images then the converted images used during the stitching process will be copied at the same time (those are TIFF files that can be big).</p></qt>
ru: <qt><p><h1><b>Панорама готова</b></h1></p><p>Поздравляем, ваши изображения теперь соединены в панораму. </p><p>Как только вы нажмёте кнопку <i>Завершить</i>, панорама будет создана в каталоге </p><p><b>%1</b></p><p>, с именем, указанным ниже.</p><p>Если вы выбрали сохранить файл проекта, и изображения были в формате RAW, то преобразованные изображения, использованные в процессе склейки, будут также одновременно скопированы туда (в формате TIFF, большой размер файлов).</p></qt>

source: <qt><p><font color="red"><b>Warning:</b> This file already exists.</font></p></qt>
ru: <qt><p><font color="red"><b>Внимание!</b> Этот файл уже существует.</font></p></qt>

source: <b>Optimization</b>
ru: <b>Оптимизация</b>

source: Level horizon
ru: Выравнивание горизонта

source: Detect the horizon and adapt the project to make it horizontal.
ru: Определение линии горизонта и горизонтальная подгонка проекта.

source: <b>Level horizon</b>: Detect the horizon and adapt the projection so that the detected horizon is an horizontal line in the final panorama
ru: <b>Выравнивание горизонта</b>: нахождение линии горизонта и подгонка проекции так, чтобы установленная линия горизонта в панораме была ровной.

source: Automatic projection
ru: Автоматическая проекция

source: Adapt the projection of the panorama and the area rendered on the resulting projection so that every photo fits in the resulting panorama.
ru: Подгонка проекции панорамы и сформированной области к полученной проекции таким образом, чтобы каждое изображение умещалось в итоговой панораме.

source: <b>Automatic projection</b>: Automatically adapt the projection and the area rendered of the panorama to get every photos into the panorama.
ru: <b>Автоматическая проекция</b>: автоматическая настройка проекции и сформированной области панорамы так, чтобы каждое изображение поместилось в панораме.

source: Details...
ru: Подробности...

source: <qt><p>Optimization is in progress, please wait.</p><p>This can take a while...</p></qt>
ru: <qt><p>Ждите, выполняется оптимизация.</p><p>Это может занять некоторое время...</p></qt>

source: <qt><p>Optimization has failed.</p><p>Press "Details" to show processing messages.</p></qt>
ru: <qt><p>Сбой оптимизации.</p><p>Нажмите кнопку «Подробности», чтобы увидеть журнал обработки.</p></qt>

source: Pre-Processing Messages
ru: Журнал предварительной обработки

source: <qt><p><h1><b>Images Pre-Processing is Done</b></h1></p><p>The optimization step according to your settings is ready to be performed.</p><p>This step can include an automatic leveling of the horizon, and also an automatic projection selection and size</p><p>To perform this operation, the <b>%1</b> program from the <a href='%2'>%3</a> project will be used.</p><p>Press the "Next" button to run the optimization.</p></qt>
ru: <qt><p><h1><b>Предварительная обработка изображений завершена.</b></h1></p><p>Теперь можно запускать процесс оптимизации, согласно установленным настройкам.</p><p>Он может включать в себя автоматическое выравнивание горизонта, а также автоматический выбор проекции и размеров.</p><p>Чтобы выполнить этот шаг, будет использована программа <b>%1</b> из проекта<a href='%2'>%3</a>.</p><p>Чтобы запустить процесс оптимизации, нажмите кнопку «Далее».</p></qt>

source: <b>Pre-Processing Images</b>
ru: <b>Идёт предварительная обработка изображений</b>

source: Detect moving skies
ru: Обнаружение подвижных облаков

source: Automatic detection of clouds to prevent wrong keypoints matching between images due to moving clouds.
ru: Автоматическое обнаружение облаков для предотвращения неправильного совмещения ключевых точек из-за движения облаков

source: <b>Detect moving skies</b>: During the control points selection and matching, this option discards any points that are associated to a possible cloud. This is useful to prevent moving clouds from altering the control points matching process.
ru: <b>Обнаружение движения облаков</b>: во время выбора контрольных точек эта опция сбрасывает любые точки, которые могут быть привязаны к возможному облаку. Это предотвращает движущиеся облака от внесения изменений в процесс совмещения контрольных точек.

source: <qt><p>Pre-processing is in progress, please wait.</p><p>This can take a while...</p></qt>
ru: <qt><p>Ждите, выполняется предварительная обработка.</p><p>Это может занять некоторое время...</p></qt>

source: <qt><p>Pre-processing has failed.</p><p>Press "Details" to show processing messages.</p></qt>
ru: <qt><p>Сбой предварительной обработки.</p><p>Нажмите кнопку «Подробности», чтобы увидеть журнал обработки.</p></qt>

source: <qt><p>Now, we will pre-process images before stitching them.</p><p>Pre-processing operations include Raw demosaicing. Raw images will be converted to 16-bit sRGB images with auto-gamma.</p><p>Pre-processing also include a calculation of some control points to match overlaps between images. For that purpose, the <b>%1</b> program from the <a href='%2'>%3</a> project will be used.</p><p>Press "Next" to start pre-processing.</p></qt>
ru: <qt><p>Теперь мы проведём предварительную обработку изображений перед тем, как их сшивать. </p><p>Предварительная обработка включает в себя демозаику RAW -изображений, которые будут преобразованы в 16-битовые изображения в формате sRGB с автоматической гамма-коррекцией.</p><p>Также производится рассчёт некоторых контрольных точек для совмещения перекрывающихся областей изображений. С этой целью будет использоваться программа <b>%1</b> из проекта <a href='%2'>%3</a>.</p><p>Для запуска предварительной обработки нажмите кнопку «Далее».</p></qt>

source: <b>Preview and Post-Processing</b>
ru: <b>Предварительный просмотр и пост-обработка</b>

source: Preview Processing Cancelled.
ru: Отмена рассчёта предварительного просмотра

source: Processing Panorama Preview...
ru: Идёт рассчёт предварительного просмотра панорамы...

source: <qt><p><h1>Panorama Post-Processing</h1></p></qt>
ru: <qt><p><h1>Пост-обработка панорамы</h1></p></qt>

source: Panorama Post-Processing
ru: Пост-обработка панорамы

source: <qt><h2><b>Error</b></h2><p>%1</p></qt>
ru: <qt><h2><b>Ошибка</b></h2><p>%1</p></qt>

source: Processing file %1 / %2: %3
ru: Обработка файла %1 / %2: %3

source: Panorama compilation: %1
ru: Составление панорамы: %1

source: <qt><p><h1>Panorama Preview</h1></p><p>Draw a rectangle if you want to crop the image.</p><p>Pressing the <i>Next</i> button will then launch the final stitching process.</p></qt>
ru: <qt><p><h1>Предварительный просмотр панорамы</h1></p><p>Нарисуйте прямоугольник, если нужно обрезать изображение. Нажатие на кнопку <i>Далее</i> запустит завершающий процесс сшивания.</p></qt>

source: Processing file %1 / %2
ru: Обработка файла %1 / %2

source: Panorama compilation
ru: Составление панорамы

source: Panorama Stitching
ru: Сшивание панорамы

source: A tool to automatically stitch images into panorama
ru: Инструмент для автоматического сшивания изображений в панораму

source: (c) 2011-2013, Benjamin Girault
ru: ©Бенжамин Жиро (Benjamin Girault), 2011-2013

source: Benjamin Girault
ru: Бенжамин Жиро (Benjamin Girault)

source: Author
ru: Автор

source: Gilles Caulier
ru: Жиль Колье (Gilles Caulier)

source: Developer
ru: Разработчик

source: File(s) to open
ru: Открыть файл(ы)

source: Stitch images into a panorama...
ru: Объединить изображения в панораму...

source: &Tools
ru: &Инструменты

source: Main Toolbar
ru: Основная панель инструментов

# NAME OF TRANSLATORS
source: Your names
ru: Юлия Дронова

# EMAIL OF TRANSLATORS
source: Your emails
ru: juliette.tux@gmail.com

source: Temporary panorama file does not exists.
ru: Временный файл панорамы не существует

source: A file named %1 already exists.
ru: Файл с именем %1 уже существует.

source: Temporary project file does not exist.
ru: Временного файла проекта не существует

source: Cannot move panorama from %1 to %2.
ru: Не удалось переместить панораму из %1 в %2.

source: Cannot move project file from %1 to %2.
ru: Не удалось переместить файл проекта из %1 в %2.

source: Cannot copy converted image file from %1 to %2.
ru: Не удалось скопировать файл преобразованного изображения из %1 в %2.

source: PTO file already created in the temporary directory.
ru: Файл PTO уже был создан во временном каталоге

source: PTO file cannot be created in the temporary directory.
ru: Не удалось создать файл PTO во временном каталоге

source: Missing project file.
ru: Файл проекта отсутствует.

source: Project file parsing failed.
ru: Сбой отрисовки файла проекта

source: Unknown input file in the project file: %1
ru: Неизвестный входной файл в файле проекта: %1

source: Input image cannot be loaded for preview generation
ru: Не удалось загрузить исходное изображение для создания предварительного просмотра

source: Operation canceled.
ru: Действие отменено.

source: Tiff image creation failed.
ru: Сбой создания изображения в формате TIFF.

source: Raw file conversion failed.
ru: Сбой преобразования файла RAW

source: Cannot run %1: %2
ru: Не удалось запустить %1: %2
